rulesTranslat = {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e',
            'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'j', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
            'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'kh', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'shch',
            'ъ': '\'', 'ы': 'y', 'ь': '\'', 'э': 'e', 'ю': 'iu', 'я': 'ia'}
word = (input("Напечатайте слово на русском языке, которое вы хотели бы транслитерировать: "))
word2 = word.lower()
word3 = list(word2)
result=""
for i in word3:
    result += rulesTranslat.get(i)
print(result)

